#Средний балл учеников
#Вводные данные:
# Список grades = [[5, 3, 3, 5, 4], [2, 2, 2, 3], [4, 5, 5, 2], [4, 4, 3], [5, 5, 5, 4, 5]] - Оценки учеников
# Множество: students = {'Johnny', 'Bilbo', 'Steve', 'Khendrik', 'Aaron'} - Имена учеников
grades = [[5, 3, 3, 5, 4], [2, 2, 2, 3], [4, 5, 5, 2], [4, 4, 3], [5, 5, 5, 4, 5]]
students = {'Johnny', 'Bilbo', 'Steve', 'Khendrik', 'Aaron'}
a = sum(grades[0]) / len(grades[0])             #Вывожу средние балл каждого ученика
b = sum(grades[1]) / len(grades[1])             #Вывожу средние балл каждого ученика
c = sum(grades[2]) / len(grades[2])             #Вывожу средние балл каждого ученика
d = sum(grades[3]) / len(grades[3])             #Вывожу средние балл каждого ученика
e = sum(grades[4]) / len(grades[4])             #Вывожу средние балл каждого ученика
#print(a, b, c, d, e) ------ 4.0 2.25 4.0 3.6666666666666665 4.8
f = [a, b, c, d, e]
#print(f) ------ [4.0, 2.25, 4.0, 3.6666666666666665, 4.8]
j = list(students)            #j - Это список Имён
j.sort()                    #Сортировал список по алфавиту
#print(j) ------ ['Aaron', 'Bilbo', 'Johnny', 'Khendrik', 'Steve']
k = dict(zip(j, f))          #k - Сортированный словарь учеников и их среднего балла. Создал при помощи Zip словарь из двух списков тем самым автоматизировав систему
print(k)